In [1]:
import sqlite3

In [2]:
import pandas as pd

In [3]:
conn = sqlite3.connect("c:\\temp\\join_example_database.db")

In [7]:
# the statement that we would normally have entered in the CLI
sql_statement = "SELECT Quantities.product, Quantities.quantity FROM Quantities"

In [8]:
sql_statement

'SELECT Quantities.product, Quantities.quantity FROM Quantities'

In [9]:
df = pd.read_sql_query(sql_statement, conn)
display(df)

    PRODUCT  QUANTITY
0  Potatoes        45
1  Avacados        63
2     Kiwis        19
3    Onions        20
4    Melons        66
5  Broccoli        27
6    Squash        92

In [10]:
df

    PRODUCT  QUANTITY
0  Potatoes        45
1  Avacados        63
2     Kiwis        19
3    Onions        20
4    Melons        66
5  Broccoli        27
6    Squash        92

In [11]:
# solving the hw question
sql_statement = "SELECT Quantities.product, Quantities.quantity FROM Quantities WHERE Quantities.quantity > 60"
q1 = pd.read_sql_query(sql_statement, conn)
q1

    PRODUCT  QUANTITY
0  Avacados        63
1    Melons        66
2    Squash        92

In [12]:
def create_connection(db_file):
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)

    return conn

In [13]:
def create_table(conn, create_table_sql):
    try:
        c = conn.cursor()
        c.execute(create_table_sql)
    except Error as e:
        print(e)

In [14]:
db_file = "C:\\temp\students.db"
conn = create_connection(db_file)

In [15]:
cur = conn.cursor()
cur.execute("SELECT first_name, last_name FROM students")
rows = cur.fetchall()
for r in rows:
    print(r)

('Joe', 'Smith')
('Jonny', 'Chitwood')
('Joseph', 'Chunger')
('John Smith', 'Calhoun')

In [16]:
rows

[('Joe', 'Smith'),
 ('Jonny', 'Chitwood'),
 ('Joseph', 'Chunger'),
 ('John Smith', 'Calhoun')]

In [17]:
cur.execute("SELECT * FROM students")
rows = cur.fetchall()

In [18]:
rows

[('Smith', 'Joe', 'joesmith', 90.0, 95.0, 97.0),
 ('Chitwood', 'Jonny', 'jchitwood', 80.0, 85.0, 87.0),
 ('Chunger', 'Joseph', 'jchunger', 70.0, 75.0, 77.0),
 ('Calhoun', 'John Smith', 'jscalhoun', 80.0, 85.0, 87.0)]

In [30]:
import os
db_file = 'c:\\temp\\students.db'
if os.path.exists(db_file):
    os.remove(db_file)

create_table_sql = """
CREATE TABLE students(
    full_name TEXT,
    exam1 REAL,
    exam2 REAL);
"""

def insert_student(conn, values):
    sql = '''
    INSERT INTO students(full_name, exam1, exam2)
    VALUES(?,?,?)
    '''
    cur = conn.cursor()
    cur.execute(sql, values)
    return cur.lastrowid
    
conn = create_connection(db_file)
with conn:
    create_table(conn, create_table_sql)
    
    for student in open('c:\\temp\\students.tsv', 'r'):
        values = student.strip().split('\t')
        print(values)
        rid = insert_student(conn, values)

['Anderson, Samuel', '84', '220']
['Cummings, Jacob', '79', '269']
['Sosa, Walter', '74', '194']
['Conway, Joel', '75', '242']
['Burton, Andrew', '105', '226']
['Harris, Judith', '109', '200']
['Thomas, Abigail', '38', '99']
['Edwards, Sarah', '119', '394']
['Pratt, Jennifer', '109', '313']
['Hess, Patricia', '99', '307']
['Butler, Brandon', '18', '69']
['Williams, Tammy', '47', '151']
['Williams, Jonathan', '51', '100']
['Perry, Amy', '135', '388']
['Mendez, Evelyn', '132', '203']
['Jackson, Elizabeth', '50', '120']
['Cameron, Douglas', '135', '317']
['Wright, Heather', '60', '143']
['Tucker, Mariah', '127', '395']
['Jones, Rachel', '131', '375']
['Hull, Tommy', '1', '3']
['Guerra, Miguel', '137', '279']
['Hernandez, Sarah', '42', '85']
['Cortez, Ellen', '56', '192']
['Lee, Tracy', '119', '273']
['Griffith, Troy', '15', '31']
['Torres, Ana', '7', '22']
['Moore, Howard', '92', '248']
['Nelson, Richard', '122', '339']
['James, Lisa', '44', '124']
['Macias, Hannah', '21', '79']
['Rodriguez, Richard', '48', '137']
['Ho, Christopher', '101', '303']
['Fisher, Raymond', '96', '312']
['Jones, Gregory', '79', '267']
['Davenport, Ashley', '33', '66']
['Peters, Jamie', '109', '368']
['Aguilar, Lisa', '100', '388']
['Bush, David', '137', '266']
['Barr, Samantha', '2', '7']
['Gordon, Steven', '61', '123']
['Jones, Matthew', '133', '331']
['Harris, Ronald', '33', '51']
['Crane, Brandon', '88', '342']
['Fry, Michael', '52', '118']
['Mann, Monica', '42', '141']
['Matthews, Richard', '112', '216']
['Perkins, Jon', '4', '14']
['Williams, Jasmine', '30', '51']
['Rowland, Kristy', '52', '180']
['Montgomery, Tanya', '101', '165']
['Mcgee, Steven', '1', '2']
['Aguilar, Amber', '53', '96']
['Stuart, Jason', '2', '4']
['Humphrey, Kyle', '16', '61']
['Stewart, Christina', '47', '176']
['Roberts, Thomas', '11', '40']
['Weber, Jason', '107', '256']
['Lee, Karen', '42', '82']
['Lopez, Edward', '35', '65']
['Baldwin, Kayla', '109', '301']
['Dunn, Madison', '99', '308']
['Brown, Sarah', '17', '43']
['Bowman, Christina', '98', '260']
['Vazquez, Jennifer', '137', '206']
['Mccarthy, Emily', '124', '367']
['Lewis, Carrie', '134', '385']
['Jackson, Mark', '113', '393']
['Weaver, Julie', '31', '98']
['Torres, Lauren', '108', '398']
['Moon, Mary', '29', '105']
['Church, Michelle', '83', '311']
['Haley, Laura', '124', '369']
['Rodriguez, Ann', '12', '31']
['Gomez, Colleen', '109', '242']
['Hunter, Amy', '19', '66']
['Davis, Anthony', '113', '393']
['Graves, Dorothy', '51', '108']
['Miller, Phyllis', '59', '154']
['Burnett, Robert', '23', '42']
['Haley, Sophia', '112', '308']
['Shaw, Ashley', '48', '136']
['Erickson, Andrew', '112', '232']
['Weaver, Rebecca', '65', '238']
['Young, Danielle', '97', '166']
['Howell, Carol', '131', '345']
['Stephens, Jasmin', '101', '266']
['Guerrero, Justin', '116', '380']
['Aguilar, Ashley', '132', '213']
['Holmes, Kelly', '109', '232']
['Fleming, Erica', '60', '91']
['Christian, Raymond', '12', '20']
['Franklin, Brian', '107', '321']
['James, Ashley', '94', '246']
['Johnson, Christine', '60', '219']
['Holland, Brian', '101', '246']
['Harrison, Rebecca', '76', '277']
['Harrell, Meagan', '61', '216']
['Mitchell, Johnny', '109', '180']
['Cooper, Kevin', '46', '108']

In [31]:
sql_statement = "SELECT * FROM Students"
df = pd.read_sql_query(sql_statement, conn)
df

            full_name  exam1  exam2
0    Anderson, Samuel   84.0  220.0
1     Cummings, Jacob   79.0  269.0
2        Sosa, Walter   74.0  194.0
3        Conway, Joel   75.0  242.0
4      Burton, Andrew  105.0  226.0
..                ...    ...    ...
95     Holland, Brian  101.0  246.0
96  Harrison, Rebecca   76.0  277.0
97    Harrell, Meagan   61.0  216.0
98   Mitchell, Johnny  109.0  180.0
99      Cooper, Kevin   46.0  108.0

[100 rows x 3 columns]

In [35]:
db = 'depts_students.db'
if os.path.exists(db):
    os.remove(db)

create_table_departments_sql = """ CREATE TABLE [Departments] (
    [DepartmentId] INTEGER  NOT NULL PRIMARY KEY,
    [DepartmentName] TEXT 
); """

create_table_students_sql = """CREATE TABLE [Students] (
    [StudentId] INTEGER  PRIMARY KEY NOT NULL,
    [StudentName] TEXT NOT NULL,
    [DepartmentId] INTEGER,
    [DateOfBirth] DATE,
    FOREIGN KEY(DepartmentId) REFERENCES Departments(DepartmentId)
);"""


depts = ('IT', 'Physics', 'Arts', 'Math')

students = (
    ('Michael', 1, '1998-10-12'),
    ('John', 1, '1998-10-12'),
    ('Jack', 1, '1998-10-12'),
    ('Sara', 2, '1998-10-12'),
    ('Sally', 2, '1998-10-12'),
    ('Jena', None, '1998-10-12'),
    ('Nancy', 2, '1998-10-12'),
    ('Adam', 3, '1998-10-12'),
    ('Stevens', 3, '1998-10-12'),
    ('George', None, '1998-10-12')
)

def insert_depts(conn, values):
    sql = ''' INSERT INTO Departments(DepartmentName)
              VALUES(?) '''
    cur = conn.cursor()
    cur.execute(sql, values)
    return cur.lastrowid


def insert_student(conn, values):
    sql = ''' INSERT INTO Students(StudentName, DepartmentId, DateOfBirth)
              VALUES(?,?,?) '''
    cur = conn.cursor()
    cur.execute(sql, values)
    return cur.lastrowid

conn = create_connection(db)

with conn:

    create_table(conn, create_table_departments_sql)
    create_table(conn, create_table_students_sql)
    for values in depts:
        insert_depts(conn, (values,))
        
    for values in students:
        insert_student(conn, values)

In [36]:
sql_statement = "SELECT * FROM Students"
df = pd.read_sql_query(sql_statement, conn)
display(df)

   StudentId StudentName  DepartmentId DateOfBirth
0          1     Michael           1.0  1998-10-12
1          2        John           1.0  1998-10-12
2          3        Jack           1.0  1998-10-12
3          4        Sara           2.0  1998-10-12
4          5       Sally           2.0  1998-10-12
5          6        Jena           NaN  1998-10-12
6          7       Nancy           2.0  1998-10-12
7          8        Adam           3.0  1998-10-12
8          9     Stevens           3.0  1998-10-12
9         10      George           NaN  1998-10-12

In [37]:
cur = conn.cursor()
cur.execute('SELECT * FROM Departments')
for row in cur.fetchall():  
    print(row)

(1, 'IT')
(2, 'Physics')
(3, 'Arts')
(4, 'Math')

In [38]:
for row in cur.fetchall():  
    print(row)

In [39]:
cur = conn.cursor()
cur.execute('SELECT * FROM Departments')
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())

(1, 'IT')
(2, 'Physics')
(3, 'Arts')
(4, 'Math')
None
None

In [40]:
conn = create_connection(db)
cur = conn.cursor()
cur.execute('SELECT * FROM Departments')
dept_fk_lookup = {}
for row in cur.fetchall():
    key, text = row
    dept_fk_lookup[text] = key
print(dept_fk_lookup)

{'IT': 1, 'Physics': 2, 'Arts': 3, 'Math': 4}

In [41]:
dept_fk_lookup.keys()

dict_keys(['IT', 'Physics', 'Arts', 'Math'])

In [42]:
dept_fk_lookup.values()

dict_values([1, 2, 3, 4])

In [52]:
db = 'depts_students.db'
if os.path.exists(db):
    os.remove(db)

create_table_departments_sql = """ CREATE TABLE [Departments] (
    [DepartmentId] INTEGER  NOT NULL PRIMARY KEY,
    [DepartmentName] TEXT 
); """

create_table_students_sql = """CREATE TABLE [Students] (
    [StudentId] INTEGER  PRIMARY KEY NOT NULL,
    [StudentName] TEXT NOT NULL,
    [DepartmentId] INTEGER,
    [DateOfBirth] DATE,
    FOREIGN KEY(DepartmentId) REFERENCES Departments(DepartmentId)
);"""

depts = ('IT', 'Physics', 'Arts', 'Math')
students = (
    ('Michael', 'IT', '1998-10-12'),
    ('John', 'IT', '1998-10-12'),
    ('Jack', 'IT', '1998-10-12'),
    ('Sara', 'Physics', '1998-10-12'),
    ('Sally', 'Physics', '1998-10-12'),
    ('Jena', None, '1998-10-12'),
    ('Nancy', 'Physics', '1998-10-12'),
    ('Adam', 'Arts', '1998-10-12'),
    ('Stevens', 'Arts', '1998-10-12'),
    ('George', None, '1998-10-12')
)

In [53]:
conn = create_connection(db)
cur = conn.cursor()
cur.execute('SELECT * FROM Departments')
dept_fk_lookup = {}
for row in cur.fetchall():
    key, text = row
    dept_fk_lookup[text] = key
print(dept_fk_lookup)

with conn:

    create_table(conn, create_table_departments_sql)
    create_table(conn, create_table_students_sql)
    for values in depts:
        insert_depts(conn, (values, ))
        
    for values in students:
        values = list(values)
        print('BEFORE', values)
        key = values[1]
        print('key', key)
        if key:
            values[1] = dept_fk_lookup[values[1]]
        print('AFTER',values)
        insert_student(conn, values)

OperationalError: no such table: Departments

In [51]:
conn.close()